use AboutCinemaDB


insert into Movies(Title, AgeRestriction, PremiereDate, Country, MoviePic, Description, Type)
values ('Скарлет и Герцог', 0, '31-03-2020', 'США', '/Images/MoviePics/Мисс_Скарлет_и_Герцог.png', 'Когда отец Элизы Скарлет умирает, она остаётся без средств к существованию. В такой ситуации единственный выход для женщины — выгодный брак. Но у Элизы есть секретное оружие — детективное агентство её отца. И чтобы преуспеть в мире, которым правят мужчины, ей нужен деловой партнёр. Им становится инспектор из Скотленд-Ярда Уильям Веллингтон.', 'сериал'),
/*2*/  ('Проект "Анна Николаевна"', 18, '26-03-2020', 'Россия', '/Images/MoviePics/Проект_Анна_Николаевна.png', 'Отечественные учёные создали андроида-полицейского. Идеальная во всех отношениях капитан Анна Николаевна Королькевич отправляется служить в провинциальный город, чтобы увидеть реальную жизнь и стать похожей на человека. Коллеги думают, что Анна Николаевна — дочь замминистра, и ничто не предвещает беды, пока очеловечивание не заходит слишком далеко.', 'сериал'),
/*3*/  ('Рик и Морти', 18, '02-12-2013', 'США', '/Images/MoviePics/Рик_и_Морти.png', 'В центре сюжета - школьник по имени Морти и его дедушка Рик. Морти - самый обычный мальчик, который ничем не отличается от своих сверстников. А вот его дедуля занимается необычными научными исследованиями и зачастую полностью неадекватен. Он может в любое время дня и ночи схватить внука и отправиться вместе с ним в безумные приключения с помощью построенной из разного хлама летающей тарелки, которая способна перемещаться сквозь межпространственный тоннель. Каждый раз эта парочка оказывается в самых неожиданных местах и самых нелепых ситуациях.', 'сериал'),
/*4*/  ('Последний министр', 18, '26-03-2020', 'Россия', '/Images/MoviePics/Последний_министр.png', 'Когда министром перспективного планирования назначают деятельного неудачника, никто представить не может, к чему это приведёт. Оказывается, новый министр действительно хочет изменить жизнь людей к лучшему и для этого вместе с командой активно продвигает собственные инициативы. Правда, инициативы эти не всегда разумны, а результат — крайне непредсказуем.', 'сериал'),
/*5*/  ('Безумие', 18, '22-04-2020', 'Россия', '/Images/MoviePics/Безумие.png', 'Пока все заперты по домам, московский режиссер и несколько известных артистов вынуждены репетировать новый спектакль удаленно. Правда, не всё идет по плану, потому что отношения, секс и родители теперь тоже онлайн. Да и сам спектакль добавляет безумия, ведь в главной роли — настоящая овца...', 'сериал'),
/*6*/  ('Джентельмены', 18, '03-12-2019', 'Великобритания', '/Images/MoviePics/Джентльмены.png', 'Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха.', 'сериал'),

/*7*/  ('Плащ и Кинжал', 18, '03-03-2018', 'США', '/Images/MoviePics/Плащ_и_Кинжал.png', 'Два подростка обнаруживают у себя новые суперспособности — Тэнди может излучать световые кинжалы, а Тайрон способен облачать людей во тьму. Они быстро понимают, что вместе им лучше, чем порознь, но их чувства друг к другу делают сложный мир еще более запутанным.', 'сериал'),
/*8*/  ('Капитан Марвел', 16, '27-02-2019', 'США', '/Images/MoviePics/Капитан_Марвел.png', 'После столкновения с враждующими инопланетными расами, пилот военно-воздушных сил Кэрол Дэнверс обретает суперсилу и становится неуязвимой. Героине предстоит совладать со своими новыми способностями, чтобы противостоять могущественному врагу.', 'фильм'),
/*9*/  ('Мстители: Война бесконечности', 16, '23-04-2018', 'США', '/Images/MoviePics/Мстители_Война_бесконечности.png', 'Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности — артефакты невероятной силы, с помощью которых можно менять реальность по своему желанию. Всё, с чем Мстители сталкивались ранее, вело к этому моменту — судьба Земли никогда ещё не была столь неопределённой.', 'фильм'),
/*10*/  ('Агенты Щ.И.Т.', 12, '19-07-2013', 'США', '/Images/MoviePics/Агенты_ЩИТ.png', 'Действия сериала разворачиваются после событий фильма «Мстители». Агент Фил Колсон возвращается в правоохранительную организацию под названием Щ.И.Т., собрав небольшую команду профессионалов, он начинает работу над новыми делами, которые порой бывают очень странными.', 'сериал'),
/*11*/  ('Человек-муравей и Оса', 12, '25-06-2018', 'США', '/Images/MoviePics/Человек-муравей_и_Оса.png', 'Скотт Лэнг, известный также как Человек-муравей, уже заслужил право оказаться в команде Мстителей. Но желание быть ближе к дочери удерживает его в родном Сан-Франциско — до тех пор, пока доктор Хэнк Пим, создавший когда-то изменяющий размеры своего владельца чудо-костюм, не призывает Скотта присоединиться к новой опасной миссии. А помогать в противостоянии с коварным врагом Человеку-муравью будет новая напарница — Оса.', 'фильм'),
/*12*/  ('Черная Пантера', 16, '29-01-2018', 'США', '/Images/MoviePics/Черная_Пантера.png', 'С первого взгляда можно решить, что Ваканда — обычная территория дикой Африки, но это не так. Здесь, в недрах пустынных земель, скрываются залежи уникального металла, способного поглощать вибрацию. Многие пытались добраться до него, разоряя всё на своём пути и принося смерть аборигенам, но каждый раз таинственный дух саванны — Чёрная Пантера — вставал на защиту угнетённых.Спустя много лет беда снова приходит в Ваканду, и в этот раз враг заручился поддержкой современных технологий. Когда шансов почти не остаётся, Т`Чалла, молодой принц Ваканды, узнаёт, что именно ему предстоит возродить легенду и продолжить вечную борьбу, надев маску Чёрной Пантеры.', 'фильм'),

/*13*/  ('Проверка на дорогах', 16, '06-10-1986', 'СССР', '/Images/MoviePics/Проверка_на_дорогах.png', 'Зима 1942 года. В одной из северо-западных областей России, оккупированной фашистами, действует партизанский отряд лейтенанта Ивана Локоткова, в прошлом — сельского милиционера. Отряд кормить нечем: в округе — одни сожженные деревни и каратели.Командир принимает решение захватить фашистский эшелон с продовольствием на узловой станции, где охраняется каждый метр. Провести операцию берется раскаявшийся полицай Лазарев, которого немцы знают в лицо. Но можно ли ему довериться?..', 'фильм'),
/*14*/  ('Звезда', 16, '11-07-2002', 'Россия', '/Images/MoviePics/Звезда.png', 'Лето 1944 года. Красная Армия приближается к западной границе СССР. В тыл врага отправляют группу разведчиков с позывными «Звезда». Молодые ребята должны выполнить задание, от которого зависит очень многое. И чтобы справиться с поставленной задачей, героям придется пожертвовать очень многим.', 'фильм'),
/*15*/  ('28 панфиловцев', 12, '02-11-2016', 'Россия', '/Images/MoviePics/28_панфиловцев.png', 'Осенью 1941-го года немецкие части, стоявшие возле Волоколамска, отделяло от Москвы каких-нибудь два часа по шоссе. Однако, на этом шоссе стояла 316-я стрелковая дивизия под командованием генерала И. В. Панфилова. Этот военачальник обладал настолько высоким авторитетом среди личного состава, что бойцы дивизии сами называли себя панфиловцами. А дивизию — панфиловской.', 'фильм'),
/*16*/  ('Брестская крепость', 16, '22-06-2010', 'Беларусь', '/Images/MoviePics/Брестская_крепость.png', 'Фильм рассказывает о героической обороне Брестской крепости, которая приняла на себя первый удар немецко-фашистских захватчиков 22 июня 1941 года. С документальной точностью описываются события, происходившие в первые дни обороны. Фильм рассказывает о главных трёх очагах сопротивления, возглавляемых командиром полка Петром Гавриловым, комиссаром Ефимом Фоминым и начальником 9-й погранзаставы Андреем Кижеватовым.', 'фильм'),
/*17*/  ('Великая война', 12, '03-05-2010', 'Россия', '/Images/MoviePics/Великая_война.png', 'Проект «Великая война» рассказывает о наиболее значимых событиях и сражениях Великой Отечественной войны.', 'сериал'),
/*18*/  ('Битва за Севастополь', 12, '02-04-2015', 'Украина', '/Images/MoviePics/Битва_за_Севастополь.png', 'Любовь под нескончаемым огнем противника, дружба с Элеонорой Рузвельт, выступление на конференции, повлиявшее на исход Второй мировой войны, желание жить и страх потерять любимого человека — справится ли со всем этим хрупкая женщина?Это реальная история Людмилы Павличенко — легендарной женщины-снайпера. Солдаты шли в бой с ее именем на устах, а враги устроили на нее охоту. На поле битвы она видела смерть и страдания, но самым серьезным испытанием для нее стала любовь, которую у нее могла забрать война.', 'фильм'),

/*19*/  ('Мэри Поппинс возвращается', 6, '29-11-2018', 'Великобритания', '/Images/MoviePics/Мэри_Поппинс_возвращается.png', 'Фильм рассказывает о новых приключениях Мэри и ее друга Джека, которым предстоит встретиться с представителями следующего поколения семейства Бэнкс.', 'фильм'),
/*20*/  ('Миа и белый лев', 6, '02-08-2018', 'Франция', '/Images/MoviePics/Миа_и_белый_лев.png', 'Миа вместе с семьей переезжает в Южную Африку из Лондона, где ее родители покупают ферму по разведению львов. Девочку ничего не радует на новом месте, ей хочется вернуться в Лондон, где остались ее друзья и беззаботная подростковая жизнь. Но внезапно на нее сваливается забота о маленьком белом львенке по имени Чарли, который остался без родителей. И вся ее жизнь круто меняется… Они становятся неразлучны, пока однажды Миа не узнает, что ее другу грозит серьезная опасность. Тогда она решает сбежать и найти для Чарли новый дом, где он будет счастлив и свободен.', 'фильм'),
/*21*/  ('Ничего себе каникулы!', 18, '15-09-2018', 'Франция', '/Images/MoviePics/Ничего_себе_каникулы.png', 'Марион — развязная и свободная, ей за тридцать, она самодостаточна и не слишком разборчива в связях. Знакомиться с парнями в Tinder для нее привычное дело. Бен — серьезный мужчина, слово «рутина» ему хорошо знакомо, и он не слишком опытен в плане знакомств по интернету. Возраст, город Париж и приложение Tinder в телефонах — больше ничего общего между ними нет. Но происходит Match, и эти двое влюбляются друг в друга на первом же свидании. Обезумев от спонтанной радости, они тут же решают отправиться в совместный отпуск. В Болгарию. Дикарями. Как скоро они обнаружат, что их представления об идеальных каникулах, мягко говоря, не совпадают?', 'фильм'),
/*22*/  ('Середина 90-х', 18, '09-09-2018', 'США', '/Images/MoviePics/Середина_90-х.png', 'Калифорния, середина 90-х. Компакт-диски ещё не вытеснили аудиокассеты, скейтбордисты ещё не засветились на MTV, а малыша Стиви всё ещё держат за ребёнка и мама, и старший брат. Все меняется, когда Стиви принимают во взрослую тусовку скейтеров-отщепенцев, и чтобы доказать свою крутость, он совершает одно смешное безумие за другим. Мальчуган сам не замечает, как в череде прогулок, хип-хоп посиделок и вечеринок развлечения перестают быть невинными.', 'фильм'),
/*23*/  ('Та еще парочка', 18, '27-06-2019', 'США', '/Images/MoviePics/Та_еще_парочка.png', 'Шарлотта Филд — госсекретарь США. Целеустремленная, умная, обворожительная, она хороша в любом деле, за которое берется. Фред Фларски — талантливый, но эксцентричный и склонный к саморазрушению журналист. У них нет ничего общего кроме того, что она — его первая любовь. И вот спустя годы они случайно встречаются вновь. Фред очаровывает Шарлотту, и она неожиданно для всех (и для самой себя) нанимает его в качестве спичрайтера для своей предвыборной кампании.', 'фильм'),
/*24*/  ('Путь домой', 6, '10-01-2019', 'Китай', '/Images/MoviePics/Путь_домой.png', 'Что делать, если тебя и твоего любимого хозяина разделяют сотни километров? Белла знает ответ: она обязательно вернется домой, чего бы ей это ни стоило. И путь ее будет полон невероятных приключений, опасностей и удивительных открытий.', 'фильм'),

/*25*/  ('Ральф', 6, '01-11-2012', 'США', '/Images/MoviePics/Ральф.png', 'Ральф — второстепенный персонаж восьмибитной компьютерной игры, и ему надоело находиться в тени главного героя, мастера на все руки Феликса, который всегда появляется, чтобы «исправить» ситуацию! После тридцати лет добросовестной работы в роли злодея, в течение которых все похвалы выпадали на долю Феликса, Ральф больше не хочет быть плохим.Он решает отправиться в путешествие по аркадным играм разных жанров, чтобы доказать всем, что и он тоже может быть героем. На своем пути Ральф встречает героев разных игр — хладнокровную сержанта Калхун из игры Hero’s Duty, оберегающую планету от нашествия инопланетных захватчиков, и сладкую на вид, но острую на язычок Сластену фон Дю, чье существование в гоночном симуляторе Sugar Rush внезапно оказывается под угрозой. Наконец-то Ральфу выпадает шанс показать, что он умеет не только разрушать!', 'фильм'),
/*26*/  ('Холодное сердце', 0, '08-04-2013', 'США', '/Images/MoviePics/Холодное_сердце.png', 'Когда сбывается древнее предсказание, и королевство погружается в объятия вечной зимы, трое бесстрашных героев — принцесса Анна, отважный Кристофф и его верный олень Свен — отправляются в горы, чтобы найти сестру Анны, Эльзу, которая может снять со страны леденящее заклятие. По пути их ждет множество увлекательных сюрпризов и захватывающих приключений: встреча с мистическими троллями, знакомство с очаровательным снеговиком по имени Олаф, горные вершины покруче Эвереста и магия в каждой снежинке. Анне и Кристоффу предстоит сплотиться и противостоять могучей стихии, чтобы спасти королевство и тех, кто им дорог.', 'фильм'),
/*27*/  ('Моана', 6, '14-12-2016', 'США', '/Images/MoviePics/Моана.png', 'Бесстрашная Моана, дочь вождя маленького племени на острове в Тихом океане, больше всего на свете мечтает о приключениях и решает отправиться в опасное морское путешествие. Вместе с некогда могущественным полубогом Мауи им предстоит пересечь океан, сразиться со страшными чудовищами и разрушить древнее заклятие.', 'фильм'),
/*28*/  ('Город героев', 6, '23-10-2014', 'США', '/Images/MoviePics/Город_героев.png', 'Юный Хиро Хамада — прирожденный изобретатель и гений конструирования роботов. Вместе со старшим братом Тадаши они воплощают в жизнь самые передовые идеи в Техническом университете города будущего Сан-Франсокио. После серии загадочных событий друзья оказываются в центре коварного заговора. Отчаявшись, Хиро решает использовать веселого и добродушного экспериментального робота Бэймакса, перепрограммировав его в неуязвимую боевую машину.', 'фильм'),
/*29*/  ('Зверополис', 6, '11-02-2016', 'США', '/Images/MoviePics/Зверополис.png', 'Добро пожаловать в Зверополис — современный город, населенный самыми разными животными, от огромных слонов до крошечных мышек. Зверополис разделен на районы, полностью повторяющие естественную среду обитания разных жителей — здесь есть и элитный район Площадь Сахары и неприветливый Тундратаун. В этом городе появляется новый офицер полиции, жизнерадостная зайчиха Джуди Хоппс, которая с первых дней работы понимает, как сложно быть маленькой и пушистой среди больших и сильных полицейских. Джуди хватается за первую же возможность проявить себя, несмотря на то, что ее партнером будет болтливый хитрый лис Ник Уайлд. Вдвоем им предстоит раскрыть сложное дело, от которого будет зависеть судьба всех обитателей Зверополиса.', 'фильм'),
/*30*/  ('Ральф против интернета', 6, '05-11-2018', 'США', '/Images/MoviePics/Ральф_против_интернета.png', 'На этот раз Ральф и Ванилопа фон Кекс выйдут за пределы зала игровых автоматов и отправятся покорять бескрайние просторы интернета, который может и не выдержать сокрушительного обаяния громилы.', 'фильм')



insert into Genres(GenreName)
values ('детектив'),    /*1*/
	   ('криминал'),    /*2*/
	   ('комедия'),     /*3*/
	   ('фантастика'),  /*4*/
	   ('драма'),  /*5*/
	   ('мультфильм'),   /*6*/
	   ('приключения'),  /*7*/
	   ('боевик'),   /*8*/
	   ('военный'),      /*9*/
	   ('исторический'), /*10*/
	   ('документальный'), /*11*/
	   ('мюзикл'), /*12*/
	   ('семейный'), /*13*/
	   ('аниме'), /*14*/
	   ('ужасы')  /*15*/


insert into GenreMovies(Genre_GenreID, Movie_MovieID)
values (1, 1), /*Мисс Скарлет и Герцог*/
	   (2, 1),
	   (3, 2), /*Проект "Анна Николаевна"*/
	   (4, 2),
	   (5, 2),
	   (6, 3), /*Рик и Морти*/
	   (3, 3),
	   (4, 3),
	   (7, 3),
	   (3, 4), /*Последний министр*/
	   (3, 5), /*Безумие*/
	   (8, 6), /*Джентельмены*/
	   (3, 6),
	   (2, 6),

	   (4, 7),/*Плащ и Кинжал*/
	   (8, 7),
	   (7, 7),
	   (4, 8),/*Капитан Марвел*/
	   (8, 8),
	   (7, 8),
	   (4, 9), /*Мстители: Война бесконечности*/
	   (8, 9),
	   (7, 9),
	   (4, 10),/*Агенты Щ.И.Т.*/
	   (8, 10),
	   (7, 10),
	   (4, 11),/*Человек-муравей и Оса*/
	   (8, 11),
	   (3, 11),
	   (4, 12),/*Черная Пантера*/
	   (8, 12),
	   (7, 12),

	   (5, 13), /*Проверка на дорогах*/
	   (9, 13),
	   (5, 14),/*Звезда*/
	   (9, 14),
	   (8, 14),
	   (5, 15),/*28 панфиловцев*/
	   (9, 15),
	   (10, 15),
	   (5, 16),/*Брестская крепость*/
	   (9, 16),
	   (11, 17),/*Великая война*/
	   (9, 17),
	   (10, 17),
	   (5, 18),/*Битва за Севастополь*/
	   (9, 18),
	   (8, 18),

	   (12, 19),
	   (13, 19),
	   (3, 19),
	   (5, 20),
	   (7, 20),
	   (13, 20),
	   (3, 21),
	   (3, 22),
	   (5, 22),
	   (2, 23),
	   (5, 23),
	   (5, 24),
	   (13, 24),

	   (6, 25), /**/
	   (3, 25),
	   (7, 25),
	   (13, 25),
	   (6, 26), /**/
	   (12, 26),
	   (3, 26),
	   (13, 26),
	   (6, 27), /**/
	   (12, 27),
	   (3, 27),
	   (7, 27),
	   (6, 28), /**/
	   (4, 28),
	   (3, 28),
	   (13, 28),
	   (6, 29), /**/
	   (2, 29),
	   (3, 29),
	   (7, 29),
	   (6, 30), /**/
	   (3, 30),
	   (7, 30),
	   (13, 30)


insert into Actors (ActorName, ActorSecondName)
values ('Кейт', 'Филлипс'),         /*1  1*/
	   ('Стюарт', 'Мартин'),        /*   2*/
	   ('Кэти', 'Дэлтон'),          /*   3*/
	   ('Зоя', 'Бербер'),           /*2  4*/
	   ('Сергей', 'Гамаш'),         /*   5*/ 
	   ('Кузьма', 'Сапрыкин'),      /*   6*/
	   ('Джастин', 'Ройланд'),      /*3  7*/
	   ('Крис', 'Парнелл'),         /*   8*/
	   ('Спенсер', 'Грэммер'),      /*   9*/
	   ('Ян', 'Цапник'),            /*4  10*/
	   ('Ольга', 'Сутулова'),       /*   11*/
	   ('Нелли', 'Уварова'),        /*   12*/
	   ('Александр', 'Молочников'), /*5  13*/
	   ('Евгений', 'Стычкин'),      /*   14*/
	   ('Кристина', 'Асмус'),       /*   15*/
	   ('Василий', 'Дахненко'),     /*6  16*/
	   ('Сергей', 'Смирнов'),       /*   17*/
	   ('Татьяна', 'Шитова'),        /*   18*/

	   ('Оливия', 'Холт'), /*7  19*/
	   ('Обри', 'Джозеф'), /*  20*/
	   ('Андреа', 'Рот'), /*  21*/
	   ('Бри', 'Ларсон'), /*8  22*/
	   ('Бен', 'Мендельсон'), /*  23*/
	   ('Джуд', 'Лоу'), /*  24*/
	   ('Крис', 'Хемсворт'), /*9  25*/
	   ('Макр', 'Руффало'), /*  26*/
	   ('Том', 'Холланд'), /*  27*/
	   ('Кларк', 'Грегг'), /*10  28*/
	   ('Бретт', 'Далтон'), /*  29*/
	   ('Хлоя', 'Беннет'), /*  30*/
	   ('Пол', 'Радд'), /*11  31*/
	   ('Майкл', 'Дуглас'), /*  32*/
	   ('Лорес', 'Фишберн'), /*  33*/
	   ('Чедвик', 'Боузман'), /*12  34*/
	   ('Лупита', 'Нионго'), /*  35*/
	   ('Данай', 'Гурира'), /*  36*/

	   ('Ролан', 'Быков'), /*13  37*/
	   ('Анатолий', 'Салоницын'), /*  38*/
	   ('Владимир', 'Заманский'), /*  39*/
	   ('Игорь', 'Петренко'), /*14  40*/
	   ('Алексей', 'Панин'), /*  41*/
	   ('Артем', 'Семакин'), /*  42*/
	   ('Александр', 'Устюгов'), /*15  43*/
	   ('Яков', 'Кучерский'), /*  44*/
	   ('Азамат', 'Нигманов'), /*  45*/
	   ('Алексей', 'Копашов'), /*16  46*/
	   ('Андрей', 'Мерзликин'), /*  47*/
	   ('Павел', 'Деревянко'), /*  48*/
	   ('Евгений', 'Сенчуков'), /*17  49*/
	   ('Анатолий', 'Юогуш'), /*  50*/
	   ('Юлия', 'Пересильд'), /*18  51*/
	   ('Евгений', 'Цыганов'), /*  52*/
	   ('Полина', 'Пахомова'), /*  53*/

	   ('Эмили', 'Блант'), /*19  54*/
	   ('Лин-Мануэль', 'Миранда'), /*  55*/
	   ('Бен', 'Уишоу'), /*  56*/
	   ('Дениа', 'Де Вилье'), /*20  57*/
	   ('Лэнгли', 'Кирквуд'), /*  58*/
	   ('Лайонел', 'Ньютон'), /*  59*/
	   ('Джонатан', 'Коэн'), /*21  60*/
	   ('Камиль', 'Шаму'), /*  61*/
	   ('Жереми', 'Элькайм'), /*  62*/
	   ('Санни', 'Сулджик'), /*22  63*/
	   ('Кэтрин', 'Уотерстон'), /*  64*/
	   ('Олэн', 'Пренатт'), /*  65*/
	   ('Шарлиз', 'Терон'), /*23  66*/
	   ('Сет', 'Роген'), /*  67*/
	   ('Джун', 'Рафаэль'), /*  68*/
	   ('Эшли', 'Джадд'), /*24  69*/
	   ('Александра', 'Шипп'), /*  70*/
	   ('Джона', 'Хауэр-Кинг'), /*  71*/

	   ('Джон', 'Си Райли'), /*25  72*/
	   ('Сара', 'Силверман'), /*  73*/
	   ('Джек', 'Макбрайер'), /*  74*/
	   ('Кристен', 'Белл'), /*26  75*/
	   ('Идина', 'Мензел'), /*  76*/
	   ('Джонатан', 'Грофф'), /*  77*/
	   ('Аулии', 'Кравальо'), /*27  78*/
	   ('Дуэйн', 'Джонсон'), /*  79*/
	   ('Рэйчел', 'Хаус'), /*  80*/
	   ('Райан', 'Поттер'), /*28  81*/
	   ('Скотт', 'Эдсит'), /*  82*/
	   ('Дэниэл', 'Хенни'), /*  83*/
	   ('Джиннифер', 'Гудвин'), /*29  84*/
	   ('Джейсон', 'Бейтман'), /*  85*/
	   ('Идрис', 'Эльба'), /*  86*/
	   ('Галь', 'Гадот'), /*30  87*/
	   ('Джейн', 'Линч'), /*  88*/
	   ('Алан', 'Тьюдик') /*  89*/


insert into MovieActors(Movie_MovieID, Actor_ActorID)
values (1, 1), /*Мисс Скарлет и Герцог*/
	   (1, 2),
	   (1, 3),
	   (2, 4), /*Проект "Анна Николаевна"*/
	   (2, 5),
	   (2, 6),
	   (3, 7), /*Рик и Морти*/
	   (3, 8),
	   (3, 9),
	   (4, 10), /*Последний министр*/
	   (4, 11),
	   (4, 12),
	   (5, 13), /*Безумие*/
	   (5, 14),
	   (5, 15),
	   (6, 16), /*Джентельмены*/
	   (6, 17),
	   (6, 18),

	   (7, 19), /*Плащ и Кинжал*/
	   (7, 20),
	   (7, 21),
	   (8, 22), /*Капитан Марвел*/
	   (8, 23),
	   (8, 24),
	   (9, 25), /*Мстители: Война бесконечности*/
	   (9, 26),
	   (9, 27),
	   (10, 28), /*Агенты Щ.И.Т.*/
	   (10, 29),
	   (10, 30),
	   (11, 31), /*Человек-муравей и Оса*/
	   (11, 32),
	   (11, 33),
	   (12, 34), /*Черная Пантера*/
	   (12, 35),
	   (12, 36),

	   (13, 37), /*Проверка на дорогах*/
	   (13, 38),
	   (13, 39),
	   (14, 40), /*Звезда*/
	   (14, 41),
	   (14, 42),
	   (15, 43), /*28 панфиловцев*/
	   (15, 44),
	   (15, 45),
	   (16, 46), /*Брестская крепость*/
	   (16, 47),
	   (16, 48),
	   (17, 49), /*Великая война*/
	   (17, 50),
	   (18, 51), /*Битва за Севастополь*/
	   (18, 52),
	   (18, 53),

	   (19, 54),
	   (19, 55),
	   (19, 56),
	   (20, 57),
	   (20, 58),
	   (20, 59),
	   (21, 60),
	   (21, 61),
	   (21, 62),
	   (22, 63),
	   (22, 64),
	   (22, 65),
	   (23, 66),
	   (23, 67),
	   (23, 68),
	   (24, 69),
	   (24, 70),
	   (24, 71),

	   (25, 72),
	   (25, 73),
	   (25, 74),
	   (26, 75),
	   (26, 76),
	   (26, 77),
	   (27, 78),
	   (27, 79),
	   (27, 80),
	   (28, 81),
	   (28, 82),
	   (28, 83),
	   (29, 84),
	   (29, 85),
	   (29, 86),
	   (30, 87),
	   (30, 88),
	   (30, 89)


insert into Directors(Name, SecondName)
values ('Деклан', 'О`Двайр'), /*Мисс Скарлет и Герцог 1*/
	   ('Максим', 'Пежемский'), /*Проект "Анна Николаевна" 2*/
	   ('Пит', 'Мишелс'), /*Рик и Морти 3*/
	   ('Уэсли', 'Арчер'),
	   ('Брайан', 'Ньютон'),
	   ('Роман', 'Волобуев'), /*Последний министр 6*/
	   ('Александр', 'Молочников'), /*Безумие 7*/
	   ('Гай', 'Ричи'), /*Джентельмены 8*/

	   ('Эми', 'Канаан Манн'),/*Плащ и Кинжал 9*/
	   ('Дженнифер', 'Фанг'),
	   ('Анна', 'Боден'),/*Капитан Марвел 11*/
	   ('Райан', 'Флек'),
	   ('Энтони', 'Руссо'),/*Мстители: Война бесконечности 13*/
	   ('Джо', 'Руссо'),
	   ('Кевин', 'Танчароэн'),/*Агенты Щ.И.Т. 15*/
	   ('Джесси', 'Бокко'),
	   ('Пейтон', 'Рид'),/*Человек-муравей и Оса 17*/
	   ('Райан', 'Куглер'),/*Черная Пантера 18*/

	   ('Алексей', 'Герман'), /*Проверка на дорогах 19*/
	   ('Николай', 'Лебедев'), /*Звезда 20*/
	   ('Ким', 'Дружинин'), /*28 панфиловцев 21*/
	   ('Андрей', 'Шальопа'),
	   ('Александр', 'Котт'), /*Брестская крепость 23*/
	   ('Анна', 'Граждан'), /*Великая война 24*/
	   ('Валерий', 'Бабич'),
	   ('Сергей', 'Мокрицкий'), /*Битва за Севастополь 26*/

	   ('Роб', 'Маршалл'), /*19  27*/
	   ('Жиль', 'Де Мэтр'), /*20  28*/
	   ('Патрик', 'Кассир'), /*21  29*/
	   ('Джона', 'Хилл'), /*22  30*/
	   ('Джонатан', 'Левин'), /*23  31*/
	   ('Чарльз', 'Мартин Смит'), /*24  32*/

	   ('Рич', 'Мур'), /*25+30  33*/
	   ('Крис', 'Бак'), /*26  34*/
	   ('Дженнифер', 'Ли'), /*  35*/
	   ('Рон', 'Клементс'), /*27  36*/
	   ('Джон', 'Маскер'), /*  37*/
	   ('Дон', 'Холл'), /*28  38*/
	   ('Крис', 'Уильямс'), /*  39*/
	   ('Байрон', 'Ховард'), /*29  40*/
	   ('Джаред', 'Буш'), /*  41*/
	   ('Фил', 'Джонстон') /*30  42*/


insert into DirectorMovies(Director_DirectorID, Movie_MovieID)
values (1, 1),
	   (2, 2),
	   (3, 3),
	   (4, 3),
	   (5, 3),
	   (6, 4),
	   (7, 5),
	   (8, 6),

	   (9, 7),
	   (10, 7),
	   (11, 8),
	   (12, 8),
	   (13, 9),
	   (14, 9),
	   (15, 10),
	   (16, 10),
	   (17, 11),
	   (18, 12),

	   (19, 13),
	   (20, 14),
	   (21, 15),
	   (22, 15),
	   (23, 16),
	   (24, 17),
	   (25, 17),
	   (26, 18),

	   (27, 19),
	   (28, 20),
	   (29, 21),
	   (30, 22),
	   (31, 23),
	   (32, 24),

	   (33, 25),
	   (33, 30),
	   (34, 26),
	   (35, 26),
	   (36, 27),
	   (37, 27),
	   (38, 28),
	   (39, 28),
	   (40, 29),
	   (41, 29),
	   (42, 30)

insert into Playlists(PlaylistTitle)
values ('Новинки'),
	   ('Киновселенная MARVEL'),
	   ('День Победы: главные фильмы и сериалы'),
	   ('Хорошее настроение'),
	   ('Детям: Disney')

insert into PlaylistMovies(Playlist_PlaylistID, Movie_MovieID)
values (1 ,1),
	   (1 ,2),
	   (1 ,3),
	   (1 ,4),
	   (1 ,5),
	   (1 ,6),

	   (2, 7),
	   (2, 8),
	   (2, 9),
	   (2, 10),
	   (2, 11),
	   (2, 12),

	   (3, 13),
	   (3, 14),
	   (3, 15),
	   (3, 16),
	   (3, 17),
	   (3, 18),

	   (4, 19),
	   (4, 20),
	   (4, 21),
	   (4, 22),
	   (4, 23),
	   (4, 24),

	   (5, 25),
	   (5, 26),
	   (5, 27),
	   (5, 28),
	   (5, 29),
	   (5, 30)

/*select Movies.MoviePic
from Playlists, PlaylistMovies, Movies
where Playlists.PlaylistID = PlaylistMovies.Playlist_PlaylistID and
	Movies.MovieID = PlaylistMovies.Movie_MovieID*/